## Simple Operations & Calculations

In [48]:
import pandas as pd
import numpy as np

# Base DataFrame
data = {
    'Name': ['Alice', np.nan, 'Charlie', 'David', 'Eva', 'Mayra',' Priyanka'],
    'Age': [25, 30, 35, 40, 22, 18, 19],
    'City': ['New York', 'London', 'Paris', 'New York', np.nan, 'Moscow', 'Berlin'],
    'Salary': [50000, np.nan, 55000, 70000, 65000, 72000, 80000],
    'Neg_col' : [-12, -34, -45, -56, -67 ,-78, -89]
}
df = pd.DataFrame(data, index=['row1', 'row2', 'row3', 'row4', 'row5', 'row6','row7'])
print(df)

           Name  Age      City   Salary  Neg_col
row1      Alice   25  New York  50000.0      -12
row2        NaN   30    London      NaN      -34
row3    Charlie   35     Paris  55000.0      -45
row4      David   40  New York  70000.0      -56
row5        Eva   22       NaN  65000.0      -67
row6      Mayra   18    Moscow  72000.0      -78
row7   Priyanka   19    Berlin  80000.0      -89

In [49]:
# 81. Sum of a column: 'Salary' column ka total sum calculate karein. 
df['Salary'].sum()

392000.0

In [50]:
# 82. Mean of a column: 'Age' column ka mean nikalen.
df['Age'].mean()

27.0

In [51]:
# 83. Maximum value in a column: 'Salary' column ki sabse badi value pata karein.
df['Salary'].max()

80000.0

In [52]:
# 84. Minimum value in a column: 'Age' column ki sabse choti value pata karein. 
df['Age'].min()

18

In [53]:
# 85. Count non-NA cells: 'City' column mein non-null values ki ginti karein. 
df['City'].count()

6

In [54]:
# 86. Calculate value counts: 'City' column mein har city kitni baar aayi hai, uski ginti karein.
df['City'].value_counts()

City
New York    2
London      1
Paris       1
Moscow      1
Berlin      1
Name: count, dtype: int64

In [55]:
# 87. Calculate value counts with percentages: Upar wale question ki tarah, lekin is baar percentage bhi show karein.
df['City'].value_counts(normalize=True).mul(100)

City
New York    33.333333
London      16.666667
Paris       16.666667
Moscow      16.666667
Berlin      16.666667
Name: proportion, dtype: float64

In [56]:
# 88. Element-wise addition: DataFrame ke do numerical columns ko aapas mein jodein.
df['Age'] + df['Salary']

row1    50025.0
row2        NaN
row3    55035.0
row4    70040.0
row5    65022.0
row6    72018.0
row7    80019.0
dtype: float64

In [57]:
# 89. Scalar multiplication: 'Age' column ke har value ko 2 se multiply karein. 
df['Age'] * 2

row1    50
row2    60
row3    70
row4    80
row5    44
row6    36
row7    38
Name: Age, dtype: int64

In [58]:
# 90. Convert strings to uppercase: 'Name' column ke sabhi strings ko uppercase mein convert karein.
df['Name']=df['Name'].str.upper()
df

           Name  Age      City   Salary  Neg_col
row1      ALICE   25  New York  50000.0      -12
row2        NaN   30    London      NaN      -34
row3    CHARLIE   35     Paris  55000.0      -45
row4      DAVID   40  New York  70000.0      -56
row5        EVA   22       NaN  65000.0      -67
row6      MAYRA   18    Moscow  72000.0      -78
row7   PRIYANKA   19    Berlin  80000.0      -89

In [59]:
# 91. Convert strings to lowercase: 'City' column ke sabhi strings ko lowercase mein convert karein.
df['City']=df['City'].str.lower()
df

           Name  Age      City   Salary  Neg_col
row1      ALICE   25  new york  50000.0      -12
row2        NaN   30    london      NaN      -34
row3    CHARLIE   35     paris  55000.0      -45
row4      DAVID   40  new york  70000.0      -56
row5        EVA   22       NaN  65000.0      -67
row6      MAYRA   18    moscow  72000.0      -78
row7   PRIYANKA   19    berlin  80000.0      -89

In [60]:
# 92. Find the length of strings: 'Name' column ke har naam ki length nikal kar ek naya column banayein.
df['Name_length']=df['Name'].str.len()
df

           Name  Age      City   Salary  Neg_col  Name_length
row1      ALICE   25  new york  50000.0      -12          5.0
row2        NaN   30    london      NaN      -34          NaN
row3    CHARLIE   35     paris  55000.0      -45          7.0
row4      DAVID   40  new york  70000.0      -56          5.0
row5        EVA   22       NaN  65000.0      -67          3.0
row6      MAYRA   18    moscow  72000.0      -78          5.0
row7   PRIYANKA   19    berlin  80000.0      -89          9.0

In [61]:
# 93. Get the cumulative sum: 'Salary' column ka cumulative sum (har row par judte hue) calculate karein.
df['Salary'].cumsum()

row1     50000.0
row2         NaN
row3    105000.0
row4    175000.0
row5    240000.0
row6    312000.0
row7    392000.0
Name: Salary, dtype: float64

In [62]:
# 94. Find the product of all items: Ek numerical column ke sabhi items ka product nikalen.
df['Salary'].prod()

7.2072000000000004e+28

In [63]:
#95. Find the index of the maximum value: 'Salary' column mein maximum value ka index label kya hai, yeh pata karein.
df['Salary'].idxmax()

'row7'

In [64]:
# 96. Find the index of the minimum value: 'Age' column mein minimum value ka index label kya hai, yeh pata karein.
df['Age'].idxmin()

'row6'

In [65]:
# 97. Round values in a column: Ek float column ke values ko 2 decimal places tak round off karein.
df['Salary'].round(2)

row1    50000.0
row2        NaN
row3    55000.0
row4    70000.0
row5    65000.0
row6    72000.0
row7    80000.0
Name: Salary, dtype: float64

In [68]:
# 98. Get the absolute value: Ek column jismein negative numbers hain, uske sabhi values ka absolute (positive) value nikalen. 
df['Neg_col'].abs()

row1    12
row2    34
row3    45
row4    56
row5    67
row6    78
row7    89
Name: Neg_col, dtype: int64

In [69]:
# 99. Calculate the median of a column: 'Salary' column ka median calculate karein.
df['Salary'].median()

67500.0

In [70]:
# 100. Check for string containment: Pata karein ki 'Name' column mein 'A' letter kitne naamo mein aata hai.
df['Name'].str.contains('A').sum()

6